OpenFOAM_v2112/ChapterSample/chapter6_overset/overset/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

./Allrun.pre

runApplication overPimpleDyMFoam

#------------------------------------------------------------------------------
